memcachedTestResult/memcachedTestResult-5nd-set_memtier_benchmark_on_host_hwBenchmark-gauss82/FM-1st-testTime40/memcached_test_prepare_P6_FM_OFF_20230809155511.log
20        Threads
5         Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         7681.30          ---          ---        12.89905        12.92700        18.94300        27.13500      8258.90 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       7681.30         0.00         0.00        12.89905        12.92700        18.94300        27.13500      8258.90 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.831        0.000
SET      10.303        5.000
SET      11.135       10.000
SET      11.519       15.000
SET      11.839       20.000
SET      12.095       25.000
SET      12.287       30.000
SET      12.479       35.000
SET      12.671       40.000
SET      12.799       45.000
SET      12.927       50.000
SET      12.991       52.500
SET      13.055       55.000
SET      13.119       57.500
SET      13.183       60.000
SET      13.183       62.500
SET      13.247       65.000
SET      13.311       67.500
SET      13.439       70.000
SET      13.503       72.500
SET      13.567       75.000
SET      13.631       76.250
SET      13.631       77.500
SET      13.695       78.750
SET      13.759       80.000
SET      13.823       81.250
SET      13.887       82.500
SET      13.951       83.750
SET      14.015       85.000
SET      14.079       86.250
SET      14.143       87.500
SET      14.207       88.125
SET      14.271       88.750
SET      14.335       89.375
SET      14.399       90.000
SET      14.463       90.625
SET      14.527       91.250
SET      14.591       91.875
SET      14.719       92.500
SET      14.847       93.125
SET      14.975       93.750
SET      15.039       94.062
SET      15.167       94.375
SET      15.295       94.688
SET      15.423       95.000
SET      15.551       95.312
SET      15.679       95.625
SET      15.871       95.938
SET      16.063       96.250
SET      16.319       96.562
SET      16.639       96.875
SET      16.767       97.031
SET      16.895       97.188
SET      17.023       97.344
SET      17.151       97.500
SET      17.279       97.656
SET      17.407       97.812
SET      17.535       97.969
SET      17.663       98.125
SET      17.919       98.281
SET      18.047       98.438
SET      18.175       98.516
SET      18.303       98.594
SET      18.431       98.672
SET      18.431       98.750
SET      18.559       98.828
SET      18.687       98.906
SET      18.943       98.984
SET      19.071       99.062
SET      19.199       99.141
SET      19.455       99.219
SET      19.583       99.258
SET      19.711       99.297
SET      19.839       99.336
SET      19.967       99.375
SET      20.223       99.414
SET      20.351       99.453
SET      20.607       99.492
SET      20.991       99.531
SET      21.375       99.570
SET      21.887       99.609
SET      22.271       99.629
SET      22.655       99.648
SET      23.039       99.668
SET      23.423       99.688
SET      23.807       99.707
SET      24.191       99.727
SET      24.575       99.746
SET      24.831       99.766
SET      25.087       99.785
SET      25.471       99.805
SET      25.599       99.814
SET      25.727       99.824
SET      25.855       99.834
SET      25.983       99.844
SET      26.239       99.854
SET      26.367       99.863
SET      26.495       99.873
SET      26.751       99.883
SET      27.007       99.893
SET      27.263       99.902
SET      27.391       99.907
SET      27.647       99.912
SET      27.775       99.917
SET      28.031       99.922
SET      28.287       99.927
SET      28.543       99.932
SET      28.927       99.937
SET      29.311       99.941
SET      29.695       99.946
SET      30.207       99.951
SET      30.591       99.954
SET      30.975       99.956
SET      31.359       99.958
SET      31.743       99.961
SET      32.255       99.963
SET      32.767       99.966
SET      33.279       99.968
SET      34.047       99.971
SET      34.815       99.973
SET      36.095       99.976
SET      36.863       99.977
SET      37.631       99.978
SET      38.655       99.979
SET      43.263       99.980
SET     224.255       99.982
SET     225.279       99.983
SET     226.303       99.984
SET     227.327       99.985
SET     228.351       99.987
SET     228.351       99.988
SET     229.375       99.988
SET     229.375       99.989
SET     229.375       99.990
SET     229.375       99.990
SET     230.399       99.991
SET     230.399       99.991
SET     230.399       99.992
SET     230.399       99.993
SET     230.399       99.993
SET     231.423       99.994
SET     231.423       99.994
SET     231.423       99.995
SET     231.423       99.995
SET     231.423       99.995
[...]
SET     232.447       99.996
SET     232.447       99.996
SET     232.447       99.996
SET     232.447       99.997
SET     232.447       99.997
SET     232.447       99.997
SET     233.471       99.997
SET     233.471       99.997
SET     233.471       99.998
SET     233.471       99.998
SET     233.471       99.998
[...]
SET     234.495       99.998
SET     234.495       99.999
SET     234.495       99.999
SET     234.495       99.999
[...]
SET     235.519       99.999
SET     235.519       99.999
SET     235.519       99.999
[...]
SET     236.543       99.999
SET     236.543       99.999
SET     236.543       99.999
SET     237.567       99.999
SET     237.567       99.999
SET     237.567       99.999
[...]
SET     238.591      100.000
SET     238.591      100.000
SET     239.615      100.000
SET     240.639      100.000
SET     240.639      100.000
SET     240.639      100.000
[...]
SET     241.663      100.000
SET     242.687      100.000
SET     242.687      100.000
SET     243.711      100.000
SET     243.711      100.000
SET     243.711      100.000
[...]
SET     244.735      100.000
SET     245.759      100.000
SET     245.759      100.000
SET     245.759      100.000
[...]
SET     246.783      100.000
SET     246.783      100.000
SET     246.783      100.000
[...]
SET     247.807      100.000
SET     247.807      100.000
SET     248.831      100.000
SET     248.831      100.000
SET     248.831      100.000
[...]
SET     251.903      100.000
SET     251.903      100.000
SET     251.903      100.000
[...]
SET     252.927      100.000
SET     252.927      100.000
SET     252.927      100.000
[...]
SET     259.071      100.000
SET     259.071      100.000
---
GET       0.000      100.000
---
WAIT      0.000      100.000